#pragma once

#include "DecorationElement/UIDecorationElementBase.h"

namespace App::Object::Decoration
{
	//==========================================================================================
	// UIのデコレーション
	//==========================================================================================
	class UIDecoration
	{
	public:
		//-----------------------------------------------------------------------
		// メイン処理
		//-----------------------------------------------------------------------
		void Updaate(const UpdateContext& a_context);		// 更新
		void Draw(const DrawContext& a_context);			// 描画

		//-----------------------------------------------------------------------
		// アクセサ
		//-----------------------------------------------------------------------
		float GetScale() const { return m_scale; }			// スケール取得

	private:
		//-----------------------------------------------------------------------
		// デコレーション本体 : 配列の後ろが最前面になる
		//-----------------------------------------------------------------------
		std::vector<std::unique_ptr<UIDecorationElementBase>> m_upElements = {};

		//-----------------------------------------------------------------------
		// デコレーション全体へ掛かる設定
		//-----------------------------------------------------------------------
		bool m_isVisible = true;	// 表示切替
		float m_scale = 0.0f;		// スケール
		
		// 飾り全体に掛ける演出
		Core::GUID m_materialGUID = {};
		Engine::ResourceRef<Engine::Resource::UIMaterial> m_materialRef = {};

	};
}